freeCadHisaTrials/baseTry1/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     hisa;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

deltaT          0.0001;

endTime         1.0;

writeControl    adjustableRunTime;

writeInterval   0.001;

purgeWrite      0;

adjustTimeStep  no;

maxCo           5.0;

writeFormat     ascii;

writePrecision  15;

runTimeModifiable true;

libs
(
    // Needed for availability of porous baffle boundary in potentialFoam
    #include "turbulenceLib"
    // Needed for availability of boundary conditions in potentialFoam
    "libhisaFiniteVolume.so"
);

functions
{
#includeFunc MachNo

}

// ************************************************************************* //
