freeCadHisaTrials/baseTry1/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          41;
        startFace       80220;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          502;
        startFace       80261;
    }
    box
    {
        type            wall;
        inGroups        1(wall);
        nFaces          516;
        startFace       80763;
    }
    outlet
    {
        type            patch;
        nFaces          41;
        startFace       81279;
    }
    sideWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80090;
        startFace       81320;
    }
)

// ************************************************************************* //
