freeCadHisaTrials/baseTry1/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (700.0 0.0 0.0);

boundaryField
{

    inlet
    {
        type                characteristicVelocityInletOutletVelocity;
        U                   ( 700.0 0.0 0.0 );
        p                   101325.0;
        T                   293.0;
        value               uniform ( 700.0 0.0 0.0 );
    }

    wall
    {
        type        boundaryCorrectedFixedValue;
        value       uniform (0 0 0);
    }

    box
    {
        type        boundaryCorrectedFixedValue;
        value       uniform (0 0 0);
    }

    outlet
    {
        type                characteristicPressureInletOutletVelocity;
        U                   ( 0.0 0.0 0.0 );
        p                   101325.0;
        T                   293.0;
        value               $internalField;
    }

    sideWalls
    {
        type        boundaryCorrectedFixedValue;
        value       uniform (0 0 0);
    }

    defaultFaces
    {
        type        slip;
        value       $internalField;
    }

}

// ************************************************************************* //
