freeCadHisaTrials/baseTry1/case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325.0;

boundaryField
{

    inlet
    {
        type        characteristicVelocityInletOutletPressure;
        U           ( 700.0 0.0 0.0 );
        p           101325.0;
        T           293.0;
        value       $internalField;
    }

    wall
    {
        type        characteristicWallPressure;
        value       $internalField;
    }

    box
    {
        type        characteristicWallPressure;
        value       $internalField;
    }

    outlet
    {
        type        characteristicPressureInletOutletPressure;
        U           ( 0.0 0.0 0.0 );
        p           101325.0;
        T           293.0;
        value       $internalField;
    }

    sideWalls
    {
        type        characteristicWallPressure;
        value       $internalField;
    }

    defaultFaces
    {
        type        characteristicWallPressure;
        value       $internalField;
    }

}

// ************************************************************************* //
