freeCadHisaTrials/baseTry1/case/0/T
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.0;

boundaryField
{

    inlet
    {
        type        characteristicVelocityInletOutletTemperature;
        U           ( 700.0 0.0 0.0 );
        p           101325.0;
        T           293.0;
        value       uniform 293.0;
    }

    wall
    {
        type        boundaryCorrectedFixedValue;
        value       uniform 293.0;
    }

    box
    {
        type        boundaryCorrectedFixedValue;
        value       uniform 293.0;
    }

    outlet
    {
        type        characteristicPressureInletOutletTemperature;
        U           ( 0.0 0.0 0.0 );
        p           101325.0;
        T           293.0;
        value       $internalField;
    }

    sideWalls
    {
        type        boundaryCorrectedFixedValue;
        value       uniform 293.0;
    }

    defaultFaces
    {
        type        characteristicWallTemperature;
        value       $internalField;
    }

}

// ************************************************************************* //
