freeCadHisaTrials/baseTry1/case/system/turbulenceLib
libturbulenceModels.so
